# Задача 1 на вывод чисел от 1 до 10
#i = 1
#for i in range(11):
#    print(i)

# Задача 2 на сумму всех чисел от 1 до 100
#a = 1
#i = 1
#while i <= 100:
#    a = a + i
#    print(a)
#    i = i + 1

# Задача 3 на сумму всех чётных чисел от 1 до 50
print(123)